---
kind: other
id: Properties.T:Autodesk.Revit.DB.ReferencePointArrayIterator
source: html/7808ce08-eb44-4836-5d46-2ec301c4ed26.htm
---
# ReferencePointArrayIterator Properties

Retrieves the item that is the current focus of the iterator.